#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.user_assigned_managed_identity.random_uuid.telemetry[0]: Refreshing state... [id=99857157-b50c-384e-bcf3-d77ead47afec]
module.log_analytics_workspace.random_uuid.telemetry[0]: Refreshing state... [id=95f09b6f-b3d1-d0c7-1969-1bf6eb79264a]
module.nat_gateway.random_uuid.telemetry[0]: Refreshing state... [id=9aef6c77-9d82-3923-e00b-0410dfe8a97d]
module.bastion_host.random_uuid.telemetry[0]: Refreshing state... [id=5b24182d-0a0a-4d97-ee1f-c8e9cecfe39a]
module.storage_account.random_uuid.telemetry[0]: Refreshing state... [id=33f2141a-085a-4f61-8fb4-a672d32d4dc1]
module.private_dns_zone_key_vault.random_uuid.telemetry[0]: Refreshing state... [id=feedcd13-951a-5915-7a80-200a8ae2cc2f]
module.bastion_host_public_ip.random_uuid.telemetry[0]: Refreshing state... [id=49441a51-43e5-c315-d609-41a3696bd400]
module.private_dns_zone_storage_account.random_uuid.telemetry[0]: Refreshing state... [id=a73d4a6b-589c-675f-d930-e1391e4314ed]
module.network_security_group.random_uuid.telemetry[0]: Refreshing state... [id=fc149ef6-a27b-f35b-d957-04a1ee0430cb]
module.avm-utl-network-ip-addresses.random_uuid.telemetry[0]: Refreshing state... [id=13188490-d660-8985-b00a-393ff1ac409e]
module.key_vault.random_uuid.telemetry[0]: Refreshing state... [id=03a021a8-7e94-9ffb-fc83-9f63cb16df1b]
module.resource_group.random_uuid.telemetry[0]: Refreshing state... [id=405f479e-6845-d3e5-ff6c-77231f52d77d]
module.virtual_network.random_uuid.telemetry[0]: Refreshing state... [id=7df2e24b-8eb4-dc0d-f076-d7c35b8987fb]
module.user_assigned_managed_identity.data.modtm_module_source.telemetry[0]: Reading...
module.bastion_host_public_ip.data.modtm_module_source.telemetry[0]: Reading...
module.storage_account.data.modtm_module_source.telemetry[0]: Reading...
module.user_assigned_managed_identity.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.bastion_host_public_ip.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.storage_account.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.key_vault.data.modtm_module_source.telemetry[0]: Reading...
module.network_security_group.data.modtm_module_source.telemetry[0]: Reading...
module.virtual_network.data.modtm_module_source.telemetry[0]: Reading...
module.avm-utl-network-ip-addresses.data.modtm_module_source.telemetry[0]: Reading...
module.private_dns_zone_storage_account.data.modtm_module_source.telemetry[0]: Reading...
module.key_vault.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.resource_group.data.modtm_module_source.telemetry[0]: Reading...
module.private_dns_zone_key_vault.data.modtm_module_source.telemetry[0]: Reading...
module.nat_gateway.data.modtm_module_source.telemetry[0]: Reading...
module.avm-utl-network-ip-addresses.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.virtual_network.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.network_security_group.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.private_dns_zone_key_vault.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.log_analytics_workspace.data.modtm_module_source.telemetry[0]: Reading...
module.nat_gateway.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.bastion_host.data.modtm_module_source.telemetry[0]: Reading...
module.resource_group.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.log_analytics_workspace.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.bastion_host.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.private_dns_zone_storage_account.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.avm-utl-network-ip-addresses.data.azapi_client_config.telemetry[0]: Reading...
module.avm-utl-network-ip-addresses.data.azapi_client_config.telemetry[0]: Read complete after 0s [id=clientConfigs/subscriptionId=1ab5dc89-603c-4f45-bdd1-a4231369b400;tenantId=da1aa744-f43d-46fd-8308-5a3f6b99452a]
module.avm-utl-network-ip-addresses.modtm_telemetry.telemetry[0]: Refreshing state... [id=d1c9bcf4-c247-472d-929b-119d2d4c852b]
module.resource_group.data.azurerm_subscription.current: Reading...
module.bastion_host_public_ip.data.azurerm_client_config.telemetry[0]: Reading...
module.virtual_network.data.azurerm_client_config.telemetry[0]: Reading...
data.azurerm_client_config.current: Reading...
module.bastion_host.data.azurerm_client_config.telemetry[0]: Reading...
module.resource_group.data.azurerm_client_config.telemetry[0]: Reading...
module.user_assigned_managed_identity.data.azurerm_client_config.telemetry[0]: Reading...
module.storage_account.data.azurerm_client_config.telemetry[0]: Reading...
module.nat_gateway.data.azurerm_client_config.telemetry[0]: Reading...
module.resource_group.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev]
module.user_assigned_managed_identity.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.storage_account.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.virtual_network.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.bastion_host.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.bastion_host_public_ip.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.resource_group.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.nat_gateway.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.key_vault.data.azurerm_client_config.telemetry[0]: Reading...
module.log_analytics_workspace.data.azurerm_client_config.telemetry[0]: Reading...
module.private_dns_zone_key_vault.data.azurerm_client_config.telemetry[0]: Reading...
module.private_dns_zone_storage_account.data.azurerm_client_config.telemetry[0]: Reading...
module.virtual_network.data.azurerm_client_config.this: Reading...
module.network_security_group.data.azurerm_client_config.telemetry[0]: Reading...
module.log_analytics_workspace.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.user_assigned_managed_identity.modtm_telemetry.telemetry[0]: Refreshing state... [id=a74551ad-648b-4b08-80d9-c40f2200b1db]
module.key_vault.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.virtual_network.modtm_telemetry.telemetry[0]: Refreshing state... [id=b26b01ca-8b9e-4532-be56-215ba0f1e5f2]
module.private_dns_zone_storage_account.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.private_dns_zone_key_vault.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.network_security_group.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.virtual_network.data.azurerm_client_config.this: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.bastion_host_public_ip.modtm_telemetry.telemetry[0]: Refreshing state... [id=c5f766a7-b3ec-4643-951e-1f12e74c30ab]
module.resource_group.modtm_telemetry.telemetry[0]: Refreshing state... [id=f982df00-7cc2-4fe3-a34f-4e97d500e2ce]
module.storage_account.modtm_telemetry.telemetry[0]: Refreshing state... [id=029c4028-29cc-441c-abd9-60d5996b63e5]
module.key_vault.modtm_telemetry.telemetry[0]: Refreshing state... [id=1ab3e8f6-814e-4e49-ab09-148ebbae8954]
module.bastion_host.modtm_telemetry.telemetry[0]: Refreshing state... [id=3c7e6609-12fb-4797-b572-a9ad33e4ec99]
module.nat_gateway.modtm_telemetry.telemetry[0]: Refreshing state... [id=f9448316-e9fe-4afa-a29e-a3080931b299]
module.log_analytics_workspace.modtm_telemetry.telemetry[0]: Refreshing state... [id=8ee01287-a949-48f2-a15c-3891c494a8fa]
module.private_dns_zone_storage_account.modtm_telemetry.telemetry[0]: Refreshing state... [id=9d9f17e5-e080-4500-8f7b-be29762a7fdc]
module.private_dns_zone_key_vault.modtm_telemetry.telemetry[0]: Refreshing state... [id=19a2eb72-1a84-4e84-a920-7882fedc6902]
module.network_security_group.modtm_telemetry.telemetry[0]: Refreshing state... [id=e07a8f89-f236-4798-8de6-03ebc84929e3]
module.resource_group.data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400]
module.nat_gateway.azurerm_nat_gateway.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/natGateways/nat-crv-githublab-demo-dev]
module.log_analytics_workspace.azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab-demo-dev]
module.private_dns_zone_key_vault.azurerm_private_dns_zone.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
module.network_security_group.azurerm_network_security_group.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-crv-githublab-demo-dev]
module.bastion_host_public_ip.azurerm_public_ip.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/publicIPAddresses/pip--crv-githublabbas-demo-dev]
module.key_vault.azurerm_key_vault.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.KeyVault/vaults/kvcrv-githublabdemodev]
module.nat_gateway.azurerm_public_ip.this["default"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/publicIPAddresses/pip-nat-crv-githublab-demo-dev]
module.private_dns_zone_storage_account.azurerm_private_dns_zone.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net]
module.user_assigned_managed_identity.azurerm_user_assigned_identity.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uami-crv-githublab-demo-dev]
module.virtual_network.azapi_resource.vnet: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev]
module.nat_gateway.azurerm_nat_gateway_public_ip_association.this["default"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/natGateways/nat-crv-githublab-demo-dev|/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/publicIPAddresses/pip-nat-crv-githublab-demo-dev]
module.network_security_group.azurerm_network_security_rule.this["no_internet"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-crv-githublab-demo-dev/securityRules/block-internet-traffic]
module.virtual_network.module.subnet["private_endpoints"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/private_endpoints]
module.storage_account.azurerm_storage_account.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Storage/storageAccounts/sacrvgithublabdemodev]
module.virtual_network.module.subnet["AzureBastionSubnet"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/AzureBastionSubnet]
module.virtual_network.module.subnet["virtual_machines"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/virtual_machines]
module.virtual_network.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev|sendToLogAnalytics]
module.bastion_host_public_ip.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/publicIPAddresses/pip--crv-githublabbas-demo-dev|sendToLogAnalytics]
module.network_security_group.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-crv-githublab-demo-dev|sendToLogAnalytics]
module.bastion_host.azurerm_bastion_host.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/bastionHosts/bas-crv-githublab-demo-dev]
module.private_dns_zone_key_vault.azurerm_private_dns_zone_virtual_network_link.this["vnetlink1"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net/virtualNetworkLinks/key-vault]
module.private_dns_zone_storage_account.azurerm_private_dns_zone_virtual_network_link.this["vnetlink1"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net/virtualNetworkLinks/storage-account]
module.bastion_host.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/bastionHosts/bas-crv-githublab-demo-dev|sendToLogAnalytics]
module.key_vault.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.KeyVault/vaults/kvcrv-githublabdemodev|sendToLogAnalytics]
module.key_vault.azurerm_private_endpoint.this["primary"]: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateEndpoints/pe-kvcrv-githublabdemodev]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.bastion_host.azurerm_bastion_host.this has changed
  ~ resource "azurerm_bastion_host" "this" {
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/bastionHosts/bas-crv-githublab-demo-dev"
        name                      = "bas-crv-githublab-demo-dev"
        tags                      = {
            "env"  = "demo"
            "type" = "avm"
        }
      + zones                     = []
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.private_dns_zone_key_vault.azurerm_private_dns_zone.this has changed
  ~ resource "azurerm_private_dns_zone" "this" {
        id                                                    = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net"
        name                                                  = "privatelink.vaultcore.azure.net"
      ~ number_of_record_sets                                 = 1 -> 2
        tags                                                  = {
            "env"  = "demo"
            "type" = "avm"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.storage_account.azurerm_storage_account.this has changed
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Storage/storageAccounts/sacrvgithublabdemodev"
      + large_file_share_enabled           = false
        name                               = "sacrvgithublabdemodev"
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = "https://sacrvgithublabdemodev.blob.core.windows.net/"
      + primary_blob_host                  = "sacrvgithublabdemodev.blob.core.windows.net"
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = "https://sacrvgithublabdemodev.dfs.core.windows.net/"
      + primary_dfs_host                   = "sacrvgithublabdemodev.dfs.core.windows.net"
      + primary_file_endpoint              = "https://sacrvgithublabdemodev.file.core.windows.net/"
      + primary_file_host                  = "sacrvgithublabdemodev.file.core.windows.net"
      + primary_location                   = "canadacentral"
      + primary_queue_endpoint             = "https://sacrvgithublabdemodev.queue.core.windows.net/"
      + primary_queue_host                 = "sacrvgithublabdemodev.queue.core.windows.net"
      + primary_table_endpoint             = "https://sacrvgithublabdemodev.table.core.windows.net/"
      + primary_table_host                 = "sacrvgithublabdemodev.table.core.windows.net"
      + primary_web_endpoint               = "https://sacrvgithublabdemodev.z9.web.core.windows.net/"
      + primary_web_host                   = "sacrvgithublabdemodev.z9.web.core.windows.net"
      + secondary_access_key               = (sensitive value)
      + secondary_connection_string        = (sensitive value)
      ~ shared_access_key_enabled          = false -> true
        tags                               = {
            "env"  = "demo"
            "type" = "avm"
        }
        # (76 unchanged attributes hidden)

      + blob_properties {
          + change_feed_enabled           = false
          + change_feed_retention_in_days = 0
          + last_access_time_enabled      = false
          + versioning_enabled            = false
            # (1 unchanged attribute hidden)
        }

      ~ identity {
          + principal_id = "3a69215b-1886-4223-982e-261f18d689bf"
          + tenant_id    = "da1aa744-f43d-46fd-8308-5a3f6b99452a"
            # (2 unchanged attributes hidden)
        }

      + queue_properties {
          + hour_metrics {
              + enabled               = false
              + include_apis          = false
              + retention_policy_days = 0
              + version               = "1.0"
            }
          + logging {
              + delete                = false
              + read                  = false
              + retention_policy_days = 0
              + version               = "1.0"
              + write                 = false
            }
          + minute_metrics {
              + enabled               = false
              + include_apis          = false
              + retention_policy_days = 0
              + version               = "1.0"
            }
        }

      + share_properties {
          + retention_policy {
              + days = 7
            }
        }

        # (1 unchanged block hidden)
    }

  # module.virtual_network.azapi_resource.vnet has changed
  ~ resource "azapi_resource" "vnet" {
      ~ body                      = {
          ~ properties       = {
              ~ dhcpOptions          = null -> {
                  + dnsServers = []
                }
                # (7 unchanged attributes hidden)
            }
            # (1 unchanged attribute hidden)
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev"
        name                      = "vnet-crv-githublab-demo-dev"
      ~ output                    = {
            id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev"
          ~ properties = {
              ~ subnets           = [
                  + {
                      + properties = {
                          + ipConfigurations  = [
                              + {},
                            ]
                          + privateEndpoints  = [
                              + {},
                            ]
                          + provisioningState = "Succeeded"
                          + purpose           = "PrivateEndpoints"
                        }
                    },
                  + {
                      + properties = {
                          + ipConfigurations  = [
                              + {},
                            ]
                          + provisioningState = "Succeeded"
                        }
                    },
                    {
                        properties = {
                            provisioningState = "Succeeded"
                        }
                    },
                  - {
                      - properties = {
                          - provisioningState = "Succeeded"
                        }
                    },
                  - {
                      - properties = {
                          - provisioningState = "Succeeded"
                        }
                    },
                ]
                # (3 unchanged attributes hidden)
            }
            tags       = {
                env  = "demo"
                type = "avm"
            }
            # (1 unchanged attribute hidden)
        }
        tags                      = {
            "env"  = "demo"
            "type" = "avm"
        }
        # (6 unchanged attributes hidden)
    }

  # module.virtual_network.module.subnet["AzureBastionSubnet"].azapi_resource.subnet has changed
  ~ resource "azapi_resource" "subnet" {
      ~ body                      = {
          ~ properties = {
              ~ addressPrefix                     = null -> "10.0.1.0/26"
              ~ serviceEndpoints                  = null -> []
                # (10 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/AzureBastionSubnet"
        name                      = "AzureBastionSubnet"
      ~ output                    = {
            id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/AzureBastionSubnet"
          ~ properties = {
              - addressPrefixes   = [
                  - "10.0.1.0/26",
                ]
              + ipConfigurations  = [
                  + {},
                ]
                # (1 unchanged attribute hidden)
            }
            # (1 unchanged attribute hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.virtual_network.module.subnet["private_endpoints"].azapi_resource.subnet has changed
  ~ resource "azapi_resource" "subnet" {
      ~ body                      = {
          ~ properties = {
              ~ addressPrefix                     = null -> "10.0.1.64/28"
              ~ serviceEndpoints                  = null -> []
                # (10 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/private_endpoints"
        name                      = "private_endpoints"
      ~ output                    = {
            id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/private_endpoints"
          ~ properties = {
              - addressPrefixes   = [
                  - "10.0.1.64/28",
                ]
              + ipConfigurations  = [
                  + {},
                ]
              + privateEndpoints  = [
                  + {},
                ]
              + purpose           = "PrivateEndpoints"
                # (1 unchanged attribute hidden)
            }
            # (1 unchanged attribute hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.virtual_network.module.subnet["virtual_machines"].azapi_resource.subnet has changed
  ~ resource "azapi_resource" "subnet" {
      ~ body                      = {
          ~ properties = {
              ~ addressPrefix                     = null -> "10.0.0.0/24"
              ~ networkSecurityGroup              = null -> {
                  + id = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/vnet-crv-githublab-demo-dev-virtual_machines-nsg-canadacentral"
                }
              ~ serviceEndpoints                  = null -> []
                # (9 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/virtual_machines"
        name                      = "virtual_machines"
      ~ output                    = {
            id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/virtual_machines"
          ~ properties = {
              - addressPrefixes   = [
                  - "10.0.0.0/24",
                ]
                # (1 unchanged attribute hidden)
            }
            # (1 unchanged attribute hidden)
        }
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.bastion_host.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "this" {
        id                             = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/bastionHosts/bas-crv-githublab-demo-dev|sendToLogAnalytics"
      + log_analytics_destination_type = "Dedicated"
        name                           = "sendToLogAnalytics"
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.bastion_host_public_ip.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "this" {
        id                             = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/publicIPAddresses/pip--crv-githublabbas-demo-dev|sendToLogAnalytics"
      + log_analytics_destination_type = "Dedicated"
        name                           = "sendToLogAnalytics"
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.key_vault.azurerm_role_assignment.this["customer_managed_key"] will be created
  + resource "azurerm_role_assignment" "this" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "97d8d8af-e819-46eb-ad3e-b6314a928861"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Service Encryption User"
      + scope                            = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.KeyVault/vaults/kvcrv-githublabdemodev"
      + skip_service_principal_aad_check = false
    }

  # module.key_vault.azurerm_role_assignment.this["deployment_user_secrets"] will be created
  + resource "azurerm_role_assignment" "this" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6a45ce14-9eee-423b-a17e-4f880c8eaecc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.KeyVault/vaults/kvcrv-githublabdemodev"
      + skip_service_principal_aad_check = false
    }

  # module.key_vault.time_sleep.wait_for_rbac_before_key_operations[0] will be created
  + resource "time_sleep" "wait_for_rbac_before_key_operations" {
      + create_duration  = "60s"
      + destroy_duration = "0s"
      + id               = (known after apply)
      + triggers         = {
          + "role_assignments" = jsonencode(
                {
                  + customer_managed_key    = {
                      + condition                              = null
                      + condition_version                      = null
                      + delegated_managed_identity_resource_id = null
                      + description                            = null
                      + principal_id                           = "97d8d8af-e819-46eb-ad3e-b6314a928861"
                      + principal_type                         = null
                      + role_definition_id_or_name             = "Key Vault Crypto Service Encryption User"
                      + skip_service_principal_aad_check       = false
                    }
                  + deployment_user_secrets = {
                      + condition                              = null
                      + condition_version                      = null
                      + delegated_managed_identity_resource_id = null
                      + description                            = null
                      + principal_id                           = "6a45ce14-9eee-423b-a17e-4f880c8eaecc"
                      + principal_type                         = null
                      + role_definition_id_or_name             = "Key Vault Administrator"
                      + skip_service_principal_aad_check       = false
                    }
                }
            )
        }
    }

  # module.network_security_group.azurerm_monitor_diagnostic_setting.this["sendToLogAnalytics"] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "this" {
        id                             = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/nsg-crv-githublab-demo-dev|sendToLogAnalytics"
      + log_analytics_destination_type = "Dedicated"
        name                           = "sendToLogAnalytics"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.storage_account.azapi_resource.containers["demo"] will be created
  + resource "azapi_resource" "containers" {
      + body                      = {
          + properties = {
              + immutableStorageWithVersioning = null
              + metadata                       = {}
              + publicAccess                   = "None"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + name                      = "demo"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = false
      + type                      = "Microsoft.Storage/storageAccounts/blobServices/containers@2023-01-01"
    }

  # module.storage_account.azurerm_monitor_diagnostic_setting.blob["sendToLogAnalytics"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "blob" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab-demo-dev"
      + name                           = "sendToLogAnalytics"
      + target_resource_id             = (known after apply)

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.storage_account.azurerm_monitor_diagnostic_setting.storage_account["sendToLogAnalytics"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "storage_account" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab-demo-dev"
      + name                           = "sendToLogAnalytics"
      + target_resource_id             = (known after apply)

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.storage_account.azurerm_private_endpoint.this["primary"] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "canadacentral"
      + name                     = "pe-sacrvgithublabdemodev"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-crv-githublab-demo-dev"
      + subnet_id                = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/private_endpoints"
      + tags                     = {
          + "env"  = "demo"
          + "type" = "avm"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = [
              + "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "pse-sacrvgithublabdemodev"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.storage_account.azurerm_role_assignment.containers["demo-contributor"] will be created
  + resource "azurerm_role_assignment" "containers" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = false
    }

  # module.storage_account.azurerm_storage_account.this is tainted, so must be replaced
-/+ resource "azurerm_storage_account" "this" {
      ~ id                                 = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Storage/storageAccounts/sacrvgithublabdemodev" -> (known after apply)
      ~ large_file_share_enabled           = false -> (known after apply)
        name                               = "sacrvgithublabdemodev"
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://sacrvgithublabdemodev.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "sacrvgithublabdemodev.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://sacrvgithublabdemodev.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "sacrvgithublabdemodev.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://sacrvgithublabdemodev.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "sacrvgithublabdemodev.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "canadacentral" -> (known after apply)
      ~ primary_queue_endpoint             = "https://sacrvgithublabdemodev.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "sacrvgithublabdemodev.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://sacrvgithublabdemodev.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "sacrvgithublabdemodev.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://sacrvgithublabdemodev.z9.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "sacrvgithublabdemodev.z9.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
        tags                               = {
            "env"  = "demo"
            "type" = "avm"
        }
        # (23 unchanged attributes hidden)

      ~ blob_properties (known after apply)
      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      ~ identity {
          ~ principal_id = "3a69215b-1886-4223-982e-261f18d689bf" -> (known after apply)
          ~ tenant_id    = "da1aa744-f43d-46fd-8308-5a3f6b99452a" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ network_rules {
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ queue_properties (known after apply)
      - queue_properties {
          - hour_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      ~ routing (known after apply)

      ~ share_properties (known after apply)
      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }

      ~ static_website (known after apply)
    }

  # module.storage_account.azurerm_storage_account_customer_managed_key.this[0] will be created
  + resource "azurerm_storage_account_customer_managed_key" "this" {
      + id                        = (known after apply)
      + key_name                  = (known after apply)
      + key_vault_id              = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.KeyVault/vaults/kvcrv-githublabdemodev"
      + key_vault_uri             = (known after apply)
      + storage_account_id        = (known after apply)
      + user_assigned_identity_id = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uami-crv-githublab-demo-dev"
    }

  # module.virtual_machine.data.azurerm_client_config.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "telemetry" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.virtual_machine.data.modtm_module_source.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "modtm_module_source" "telemetry" {
      + module_path    = ".terraform/modules/virtual_machine"
      + module_source  = (known after apply)
      + module_version = (known after apply)
    }

  # module.virtual_machine.azurerm_key_vault_secret.admin_ssh_key[0] will be created
  + resource "azurerm_key_vault_secret" "admin_ssh_key" {
      + content_type            = "text/plain"
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.KeyVault/vaults/kvcrv-githublabdemodev"
      + name                    = "vm-crv-githublab-demo-dev-azureuser-ssh-private-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.virtual_machine.azurerm_linux_virtual_machine.this[0] will be created
  + resource "azurerm_linux_virtual_machine" "this" {
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = "vm-crv-githublab-demo-dev"
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + encryption_at_host_enabled                             = false
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "canadacentral"
      + max_bid_price                                          = -1
      + name                                                   = "vm-crv-githublab-demo-dev"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-crv-githublab-demo-dev"
      + size                                                   = "Standard_B1s"
      + tags                                                   = {
          + "env"  = "demo"
          + "type" = "avm"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false
      + zone                                                   = "1"

      + admin_ssh_key {
          + public_key = (known after apply)
          + username   = "azureuser"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + id                        = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts-gen2"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.virtual_machine.azurerm_monitor_diagnostic_setting.this_vm_diags["sendToLogAnalytics"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "this_vm_diags" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab-demo-dev"
      + name                           = "sendToLogAnalytics"
      + target_resource_id             = (known after apply)

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.virtual_machine.azurerm_network_interface.virtualmachine_network_interfaces["private"] will be created
  + resource "azurerm_network_interface" "virtualmachine_network_interfaces" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "canadacentral"
      + mac_address                    = (known after apply)
      + name                           = "nic-crv-githublab-demo-dev"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "rg-crv-githublab-demo-dev"
      + tags                           = {
          + "env"  = "demo"
          + "type" = "avm"
        }
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "private"
          + primary                                            = true
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/virtual_machines"
        }
    }

  # module.virtual_machine.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = (known after apply)
          + "module_version"  = (known after apply)
          + "random_id"       = (known after apply)
          + "subscription_id" = (known after apply)
          + "tenant_id"       = (known after apply)
        }
    }

  # module.virtual_machine.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.virtual_machine.tls_private_key.this[0] will be created
  + resource "tls_private_key" "this" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.virtual_network.azapi_resource.vnet will be updated in-place
  ~ resource "azapi_resource" "vnet" {
      ~ body                      = {
          ~ properties       = {
              ~ dhcpOptions          = {
                  - dnsServers = []
                } -> null
                # (7 unchanged attributes hidden)
            }
            # (1 unchanged attribute hidden)
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev"
        name                      = "vnet-crv-githublab-demo-dev"
      ~ output                    = {
          - id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev"
          - properties = {
              - addressSpace      = {
                  - addressPrefixes = [
                      - "10.0.0.0/22",
                    ]
                }
              - provisioningState = "Succeeded"
              - resourceGuid      = "ad603c91-df95-4429-a48d-159f94fb2d47"
              - subnets           = [
                  - {
                      - properties = {
                          - ipConfigurations  = [
                              - {},
                            ]
                          - privateEndpoints  = [
                              - {},
                            ]
                          - provisioningState = "Succeeded"
                          - purpose           = "PrivateEndpoints"
                        }
                    },
                  - {
                      - properties = {
                          - ipConfigurations  = [
                              - {},
                            ]
                          - provisioningState = "Succeeded"
                        }
                    },
                  - {
                      - properties = {
                          - provisioningState = "Succeeded"
                        }
                    },
                ]
            }
          - tags       = {
              - env  = "demo"
              - type = "avm"
            }
          - type       = "Microsoft.Network/virtualNetworks"
        } -> (known after apply)
        tags                      = {
            "env"  = "demo"
            "type" = "avm"
        }
        # (6 unchanged attributes hidden)
    }

  # module.key_vault.module.keys["cmk_for_storage_account"].azurerm_key_vault_key.this will be created
  + resource "azurerm_key_vault_key" "this" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "decrypt",
          + "encrypt",
          + "sign",
          + "unwrapKey",
          + "verify",
          + "wrapKey",
        ]
      + key_size                = 2048
      + key_type                = "RSA"
      + key_vault_id            = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.KeyVault/vaults/kvcrv-githublabdemodev"
      + n                       = (known after apply)
      + name                    = "cmk-for-storage-account"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)
    }

  # module.virtual_network.module.subnet["AzureBastionSubnet"].azapi_resource.subnet will be updated in-place
  ~ resource "azapi_resource" "subnet" {
      ~ body                      = {
          ~ properties = {
              ~ addressPrefix                     = "10.0.1.0/26" -> null
              ~ serviceEndpoints                  = [] -> null
                # (10 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/AzureBastionSubnet"
        name                      = "AzureBastionSubnet"
      ~ output                    = {
          - id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/AzureBastionSubnet"
          - properties = {
              - ipConfigurations  = [
                  - {},
                ]
              - provisioningState = "Succeeded"
            }
          - type       = "Microsoft.Network/virtualNetworks/subnets"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.virtual_network.module.subnet["private_endpoints"].azapi_resource.subnet will be updated in-place
  ~ resource "azapi_resource" "subnet" {
      ~ body                      = {
          ~ properties = {
              ~ addressPrefix                     = "10.0.1.64/28" -> null
              ~ serviceEndpoints                  = [] -> null
                # (10 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/private_endpoints"
        name                      = "private_endpoints"
      ~ output                    = {
          - id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/private_endpoints"
          - properties = {
              - ipConfigurations  = [
                  - {},
                ]
              - privateEndpoints  = [
                  - {},
                ]
              - provisioningState = "Succeeded"
              - purpose           = "PrivateEndpoints"
            }
          - type       = "Microsoft.Network/virtualNetworks/subnets"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.virtual_network.module.subnet["virtual_machines"].azapi_resource.subnet will be updated in-place
  ~ resource "azapi_resource" "subnet" {
      ~ body                      = {
          ~ properties = {
              ~ addressPrefix                     = "10.0.0.0/24" -> null
              ~ networkSecurityGroup              = {
                  - id = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/networkSecurityGroups/vnet-crv-githublab-demo-dev-virtual_machines-nsg-canadacentral"
                } -> null
              ~ serviceEndpoints                  = [] -> null
                # (9 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/virtual_machines"
        name                      = "virtual_machines"
      ~ output                    = {
          - id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/virtualNetworks/vnet-crv-githublab-demo-dev/subnets/virtual_machines"
          - properties = {
              - provisioningState = "Succeeded"
            }
          - type       = "Microsoft.Network/virtualNetworks/subnets"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 18 to add, 7 to change, 1 to destroy.

Changes to Outputs:
  ~ resource_ids   = {
      + bastion_host                   = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/bastionHosts/bas-crv-githublab-demo-dev"
      + bastion_host_public_ip         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.Network/publicIPAddresses/pip--crv-githublabbas-demo-dev"
      + key_vault                      = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.KeyVault/vaults/kvcrv-githublabdemodev"
      + network_interface              = (known after apply)
      + storage_account                = (known after apply)
      + user_assigned_managed_identity = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uami-crv-githublab-demo-dev"
      + virtual_machine                = (known after apply)
        # (6 unchanged attributes hidden)
    }

Warning: Argument is deprecated

  with module.virtual_machine.azurerm_linux_virtual_machine.this[0],
  on .terraform/modules/virtual_machine/main.linux_vm.tf line 41, in resource "azurerm_linux_virtual_machine" "this":
  41:   vm_agent_platform_updates_enabled                      = var.vm_agent_platform_updates_enabled

this property has been deprecated due to a breaking change introduced by the
Service team, which redefined it as a read-only field within the API

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @ch-rob, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*